resultados/redis_baseline_bench.txt
====== BF.ADD bloom_bench __rand_int__ ======
  1000000 requests completed in 0.91 seconds
  50 parallel clients
  53 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.471 milliseconds (cumulative count 50)
50.000% <= 2.079 milliseconds (cumulative count 505300)
75.000% <= 2.231 milliseconds (cumulative count 753150)
87.500% <= 2.407 milliseconds (cumulative count 875700)
93.750% <= 2.607 milliseconds (cumulative count 938550)
96.875% <= 2.903 milliseconds (cumulative count 968900)
98.438% <= 3.191 milliseconds (cumulative count 984500)
99.219% <= 3.479 milliseconds (cumulative count 992200)
99.609% <= 3.703 milliseconds (cumulative count 996100)
99.805% <= 3.855 milliseconds (cumulative count 998100)
99.902% <= 3.927 milliseconds (cumulative count 999100)
99.951% <= 3.967 milliseconds (cumulative count 999550)
99.976% <= 4.007 milliseconds (cumulative count 999800)
99.988% <= 4.031 milliseconds (cumulative count 999900)
99.994% <= 4.039 milliseconds (cumulative count 999950)
99.997% <= 4.055 milliseconds (cumulative count 1000000)
100.000% <= 4.055 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.005% <= 0.503 milliseconds (cumulative count 50)
0.045% <= 0.607 milliseconds (cumulative count 450)
0.065% <= 0.703 milliseconds (cumulative count 650)
0.085% <= 0.807 milliseconds (cumulative count 850)
0.090% <= 0.903 milliseconds (cumulative count 900)
0.115% <= 1.103 milliseconds (cumulative count 1150)
0.210% <= 1.207 milliseconds (cumulative count 2100)
0.275% <= 1.303 milliseconds (cumulative count 2750)
0.365% <= 1.407 milliseconds (cumulative count 3650)
0.575% <= 1.503 milliseconds (cumulative count 5750)
1.130% <= 1.607 milliseconds (cumulative count 11300)
2.515% <= 1.703 milliseconds (cumulative count 25150)
6.310% <= 1.807 milliseconds (cumulative count 63100)
15.770% <= 1.903 milliseconds (cumulative count 157700)
34.880% <= 2.007 milliseconds (cumulative count 348800)
55.375% <= 2.103 milliseconds (cumulative count 553750)
98.095% <= 3.103 milliseconds (cumulative count 980950)
100.000% <= 4.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1094091.88 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        2.133     0.464     2.079     2.671     3.367     4.055