resultados/redis_modificado_bench.txt
====== MF.ADD mod_bench __rand_int__ ======
  1000000 requests completed in 0.51 seconds
  50 parallel clients
  50 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.231 milliseconds (cumulative count 100)
50.000% <= 1.095 milliseconds (cumulative count 502250)
75.000% <= 1.199 milliseconds (cumulative count 751900)
87.500% <= 1.311 milliseconds (cumulative count 878600)
93.750% <= 1.447 milliseconds (cumulative count 937700)
96.875% <= 1.671 milliseconds (cumulative count 969000)
98.438% <= 1.935 milliseconds (cumulative count 984400)
99.219% <= 2.055 milliseconds (cumulative count 992600)
99.609% <= 2.151 milliseconds (cumulative count 996200)
99.805% <= 5.295 milliseconds (cumulative count 998050)
99.902% <= 5.559 milliseconds (cumulative count 999050)
99.951% <= 5.695 milliseconds (cumulative count 999550)
99.976% <= 5.775 milliseconds (cumulative count 999800)
99.988% <= 5.791 milliseconds (cumulative count 999900)
99.994% <= 5.807 milliseconds (cumulative count 999950)
99.997% <= 5.815 milliseconds (cumulative count 1000000)
100.000% <= 5.815 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.200% <= 0.303 milliseconds (cumulative count 2000)
0.505% <= 0.407 milliseconds (cumulative count 5050)
0.960% <= 0.503 milliseconds (cumulative count 9600)
1.725% <= 0.607 milliseconds (cumulative count 17250)
2.645% <= 0.703 milliseconds (cumulative count 26450)
4.120% <= 0.807 milliseconds (cumulative count 41200)
8.850% <= 0.903 milliseconds (cumulative count 88500)
25.815% <= 1.007 milliseconds (cumulative count 258150)
52.610% <= 1.103 milliseconds (cumulative count 526100)
76.535% <= 1.207 milliseconds (cumulative count 765350)
87.245% <= 1.303 milliseconds (cumulative count 872450)
92.735% <= 1.407 milliseconds (cumulative count 927350)
94.980% <= 1.503 milliseconds (cumulative count 949800)
96.390% <= 1.607 milliseconds (cumulative count 963900)
97.105% <= 1.703 milliseconds (cumulative count 971050)
97.695% <= 1.807 milliseconds (cumulative count 976950)
98.200% <= 1.903 milliseconds (cumulative count 982000)
98.940% <= 2.007 milliseconds (cumulative count 989400)
99.475% <= 2.103 milliseconds (cumulative count 994750)
99.750% <= 3.103 milliseconds (cumulative count 997500)
100.000% <= 6.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1964636.50 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.128     0.224     1.095     1.511     2.023     5.815